#include <iostream>
#include <string>
using namespace std;
int main(){
  int button;
  cout<<"разработанно Андержановым Олегом\n";
  cout<<"Здравствуйте, вас приветсвует Олегоконвертер vBeta 0.0.0.8! Чтобы продолжить, нажмите любую цифру\n";
  cin>>button;
  //cout<<"\t"<<"\t"<<"\t"<<"\t"<<"\t"<<"\t"<<"\t"<<"#\n";
  cout<<" _____________________________________________________\n";
  cout<<"| Выбери единицу измерения                            |\n";
  cout<<"| чтобы выбрать температру, нажмите 1                 |\n";
  cout<<"| чтобы выбрать длинну, нажмите 2                     |\n";
  cout<<"| чтобы выбрать массу, нажмите 3                      |\n";
  cout<<"| чтобы выбрать давление, нажмите 4(малый арсенал)    |\n";
  cout<<"| Чтобы выбрать более сложный перевод длинны нажмите 6|\n";
  cout<<"| Чтобы выбрать более сложный перевод масс, нажмите 7 |\n";
  cout<<"| Чтобы выбрать электрический ток, нажмите 8          |\n";
  cout<<"| информация об обновлении - 5                        |\n";
  cout<<"|_____________________________________________________|\n";
  int b;
  cin>>b;
  if(b == 1){
  float a;
  cout<<" _____________________________________________\n";
  cout<<"|введите число, которое нужно конвертировать  |\n";
  cout<<"|_____________________________________________|\n";
  cin>>a; 
cout<<" ________________________________________________________________\n";
cout<<"| Чтобы перевести температуру из Фаренгейта в Цельсий, нажмите 0 |\n";
cout<<"| Чтобы перевести температуру из цельсия в фаренгейт, нажмите 1  |\n";
cout<<"| Чтобы перевести температуру из кельвина в Цельсий, нажмите 2   |\n";
cout<<"| Чтобы перевести температуру из цельсия в кельвин, нажмите 3    |\n";
cout<<"| Чтобы перевести температуру из кельвина в фаренгейт, нажмите 4 |\n";
cout<<"| Чтобы перевести температуру из фаренгета в кельвин, нажмите 5  |\n";
cout<<"|________________________________________________________________|\n";
float temperature;
cin>>temperature;
float res;
if(temperature==0){
  res = (a-32)*5/9;

  cout<<"|темепратура по Цельсию равна"<<" "<<res<<" "<<"градусов|\n";
} else {
  if(temperature==1){
  res = a*9/5+32;
  cout<<"|Температура по Фаренгейту равна"<<" "<<res<<" "<<"градусов|\n";
  }
}
if(temperature == 2){
  res = a-273.15;
  cout<<"|Температура по Кельвину равна"<<" "<<res<<" "<<"градусов|\n";
}
if(temperature == 3){
  res = a+273.15;
  cout<<"Температура по Цельсию равна"<<" "<<res<<" "<<"градусов|\n";
}
if(temperature == 4){
  res = (a-273.15)*9/5+32;
  cout<<"|Температура по фаренгейту равна"<<" "<<res<<" "<<"градусов|\n";
}
if(temperature == 5){
  res = (a-32)*5/9+273.15;
  cout<<"|Температура по кельвину равна"<<" "<<res<<" "<<"градусов\n|";
}
  }
  if(b==2){
    float num1;
    cout<<" ___________________________________________\n";
    cout<<"|введите число, которое нужно конвертировать|"<<endl;
    cout<<"|___________________________________________|\n";
    cin>>num1;
    cout<<" ____________________________________________________\n";
    cout<<"| чтобы перевести километры в метры, нажмите 0       |\n";
    cout<<"| чтобы перевести метр в дециметр, нажмите 1         |\n";
    cout<<"| чтобы перевести дециметр в сантиметр, нажмите 2    |\n";
    cout<<"| чтобы перевести сантиметр в миллиметр, нажмите 3   |\n";
    cout<<"| чтобы перевести метры в километры, нажмите 4       |\n";
    cout<<"| чтобы перевести дециметры в метры, нажмите 5       |\n";
    cout<<"| чтобы перевести сантиметры в дециметры, нажмите 6  |\n";
    cout<<"| чтобы перевести миллиметры в сантиметры, нажмите 7 |\n";
    cout<<"| чтобы перевести километры в дециметры, нажмите 8   |\n";
    cout<<"| чтобы перевести километры в сантиметры, нажмите 9  |\n";
    cout<<"| чтобы перевести километры в миллиметры, нажмите 10 |\n";
    cout<<"| чтобы перевести метры в сантиметры, нажмите 11     |\n";
    cout<<"| чтобы перевести метры в миллиметры, нажмите 12     |\n";
    cout<<"|____________________________________________________|\n";
    /*cout<<"чтобы перевести километры в дюймы, нажмите 13\n";
    cout<<"чтобы перевести метры в дюймы, нажмите 14\n";
    cout<<"чтобы перевести дециметры в дюймы, нажмите 15\n";
    cout<<"чтобы перевести сантиметры в дюймы, нажмите 16\n";
    cout<<"чтобы перевести миллиметры в дюймы, нажмите 17\n";
    cout<<"чтобы перевести километры в мили, нажмите 18(new!)\n";
    cout<< "чтобы перевести метры в мили, нажмите 19(new!)\n";
    cout<<"Чтобы перевести дециметры в мили, нажмите 20(new!)\n";
    cout<<"Чтобы перевести сантиметры в мили, нажмите 21(new!)\n";
    cout<<"Чтобы перевести миллиметры в мили, нажмите 22(new!)\n"; */
    float length;
    cin>>length;
    float res;
    if(length==0){
      res = num1*1000;
      cout<<"|"<<num1<<" "<<"километров\t"<<"="<<" "<<res<<" "<<"метров|"<<endl;
    }
    if(length==1){
      res = num1*10;
      cout<<"|"<<num1<<" "<<"метров\t"<<"="<<" "<<res<<" "<<"дециметров|\n";
    }
    if(length == 2){
      res = num1*10;
      cout<<"|"<<num1<<" "<<"дециметров\t"<<"="<<" "<<res<<" "<<"сантиметров|\n";
    }
    if(length==3){
      res = num1*10;
      cout<<"|"<<num1<<" сантиметров\t"<<"="<<" "<<res<<" "<<"миллиметров|\n";
    }
    if(length == 4){
      res = num1/1000;
      cout<<"|"<<num1<<" метров\t"<<"="<<" "<<res<<" "<<"километров|\n";
    }
    if(length == 5){
      res = num1/10;
      cout<<"|"<<num1<<" дециметров\t"<<"="<<" "<<res<<" "<<"метров|\n";
    }
    if(length==6){
      res = num1/10;
      cout<<"|"<<num1<<" сантиметров\t"<<"="<<" "<<res<<" "<<"дециметров|\n";
    }
    if(length==7){
      res = num1/10;
      cout<<"|"<<num1<<" "<<"миллиметров\t"<<"="<<" "<<res<<" "<<"сантиетров\n";
    }
    if(length==8){
      res = num1*10000;
      cout<<"|"<<num1<<" километров\t"<<"="<<" "<<res<<" "<<"Дециметров|\n";
    }
    if(length==9){
      res = num1*100000;
      cout<<"|"<<num1<<" километров\t"<<"="<<" "<<res<<" "<<"сантиметров|"<<endl;
    }
    if(length==10){
      res = num1*1000000;
      cout<<"|"<<num1<<"километров\t"<<"="<<" "<<res<<" "<<"миллиметров|\n";
    }
    if(length==11){
      res = num1*100;
      cout<<"|"<<num1<<" метров\t"<<"="<<" "<<res<<" "<<"сантиметров|\n";
    }
    if(length==12){
      res = num1*1000;
      cout<<"|"<<num1<<" метров\t"<<"="<<" "<<res<<" "<<"миллиметров|"<<endl;
    }
    /*if(length==13){
      res = num1*39370;
      cout<<num1<<" "<<"километров\t"<<"="<<" "<<res<<" "<<"дюймов\n";
    }
    if(length==14){
      res = num1*39.3701;
      cout<<num1<<" "<<"метров\t"<<"="<<" "<<res<<" "<<"дюймов\n";
    }
    if(length==15){
      res = num1*3.93701;
      cout<<num1<<" "<<"дециметров\t"<<"="<<" "<<res<<" "<<"дюймов\n";
    }
    if(length==16){
      res = num1*2.54;
      cout<<num1<<" "<<"сантиметров\t"<<"="<<" "<<res<<" "<<"дюймов\n";
    }
    if(length==17){
      res = num1*25.4;
      cout<<num1<<" "<<"миллиметров\t"<<"="<<" "<<res<<" "<<"дюймов\n";
    }
    if(length==18){
      res = num1/1.609;
      cout<<num1<<" километров\t"<<"="<<" "<<res<<" миль\n";
    }
    if(length == 19){
      res = num1/1609;
      cout<<num1<<" метров\t"<<"="<<" "<<res<<" миль\n";
    }
    if(length==20){
      res = num1/16093;
      cout<<num1<<" дециметров\t"<<"="<<" "<<res<<" миль\n";
    }
    if(length==21){
      res = num1/160934;
      cout<<num1<<" сантиметров\t"<<"="<<" "<<res<<" миль\n";
    }
    if(length==22){
      res = num1/1.609e+6;
      cout<<num1<<" миллиметров\t"<<"="<<" "<<res<<" миль\n";
    }
*/
  }
  if(b==3){
   float a;
   cout<<" ____________________________________________ \n";
   cout<<"|введите число, которое нужно конвертировать |"<<endl;
   cout<<"|____________________________________________|\n";
   cin>>a;
   cout<<" ____________________________________________________\n";
   cout<<"|Чтобы перевести тонну в килограммы, нажмите 0       |\n";
   cout<<"|Чтобы перевести килограммы в граммы, нажмите 1      |\n;";
   cout<<"|Чтобы перевести граммы в миллиграммы, нажмите 2     |\n";
   cout<<"|Чтобы перевести миллиграммы в граммы, нажмите 3     |\n";
   cout<<"|Чтобы перевести граммы в килограммы, нажмите 4      |\n";
   cout<<"|Чтобы перевести килограммы в тонны, нажмите 5       |\n";
   cout<<"|Чтобы перевести тонны в граммы, нажмите 6           |\n";
   cout<<"|Чтобы перевести тонны в миллиграммы, нажмите 7      |\n";
   cout<<"|Чтобы перевести килограммы в миллиграммы, нажмите 8 |\n";
   cout<<"|Чтобы перевести граммы в тонны, нажмите 9           |\n";
   cout<<"|____________________________________________________|\n";
   /*cout<<"Чтобы перевести тонны в фунты, нажмите 10(new)\n";
   cout<<"Чтобы перевести килограммы в фунты,нажмите 11(new)\n";
   cout<<"Чтобы перевести граммы в фунты, нажмите 12(new)\n";
   cout<<"Чтобы перевести милиграммы в фунты, нажмите 13(new)\n";
   cout<<"чтобы перевести фунты в миллиграммы, нажмите 14(new)\n";
   cout<<"Чтобы перевести фунты в граммы, нажмите 15(new)\n";
   cout<<"Чтобы перевести фунты в килограммы, нажмите 16(new)\n";
   cout<<"Чтобы перевести фунты в тонны, нажмите 17(new)\n"; */
   float weight;
   cin>>weight;
   float res;
   if(weight==0){
     res = a*1000;
     cout<<"|"<<a<<" тонн\t"<<"="<<" "<<res<<" "<<"килограмм|\n";
   }
   if(weight==1){
     res = a*1000;
     cout<<"|"<<a<<"килограмм\t"<<"="<<" "<<res<<" "<<"грамм|\n";
   }
   if(weight==2){
     res = a*1000;
     cout<<"|"<<a<<" грамм\t"<<"="<<" "<<res<<" "<<"миллиграмм|\n";
  }
  if(weight==3){
    res = a/1000;
    cout<<"|"<<a<<" миллиграмм\t"<<"="<<" "<<res<<" "<<"грамм|\n";
  }
     if(weight == 4){
       res = a/1000;
       cout<<"|"<<a<<" грамм\t"<<"="<<" "<<res<<" "<<"килограмм|"<<endl;
     }
     if(weight == 5){
       res = a/1000;
       cout<<"|"<<a<<" килограмм\t"<<"="<<" "<<res<<"тонн|\n";
     }
     if(weight==6){
       res = a*1000000;
       cout<<"|"<<a<<" тонн\t"<<"="<<" "<<res<<" "<<"грамм|\n";
     }
     if(weight==7){
       res = a*1000000000;
       cout<<"|"<<a<<" тонн\t"<<"="<<" "<<res<<" "<<"грамм|\n";
     }
     if(weight==8){
       res = a*1000000;
       cout<<"|"<<a<<" килограмм\t"<<"="<<" "<<res<<" "<<"миллиграмм|\n";
     }
     if(weight==9){
       res = a/1000000;
       cout<<"|"<<a<<" грамм\t"<<"="<<" "<<res<<" "<<"тонн|\n";
     }
     if(weight == 10){
       res = a*2205;
       cout<<"|"<<a<<" тонн\t"<<"= "<<res<<" фунтов|\n";
     }
     if(weight==11){
       res = a*2.205;
       cout<<"|"<<a<<" килограмм\t"<<"= "<<res<<" фунтов|\n";
     }
     if(weight==12){
       res = a/454;
       cout<<"|"<<a<<" грамм\t"<<"= "<<res<<" фунтов|\n";
     }
     if(weight==13){
       res = a/453593;
       cout<<"|"<<a<<" миллиграмм\t"<<"= "<<res<<" фунтов|\n";
     }
     if(weight==14){
       res = a*453593;
       cout<<"|"<<a<<" фунтов\t"<<"= "<<res<<" миллиграмм|\n";
     }
     if(weight==15){
       res = a*454;
       cout<<"|"<<a<<" фунтов\t"<<"= "<<res<<" грамм|\n";
     }
     if(weight==16){
       res = a/2.205;
       cout<<"|"<<a<<" фунтов\t"<<"= "<<res<<" килограмм|\n";
     }
     if(weight==17){
       res = a/2205;
       cout<<"|"<<a<<" фунтов\t"<<"= "<<res<<" тонн|\n";
     }
  }
  if(b==4){
    float a;
    cout<<" ____________________________________________\n";
    cout<<"|введите число, которое нужно конвертировать |"<<endl;
    cout<<"|____________________________________________|\n";
    cin>>a;
    cout<<" _______________________________________________\n";
    cout<<"|Чтобы перевести Атмосферу в Бар, нажмите 0     |\n";
    cout<<"|Чтобы перевести Бар в Паскаль, нажмите 1       |\n";
    cout<<"|Чтобы перевести мм.рт.ст. в Паскаль, нажмите 2 |\n";
    cout<<"|Чтобы перевести Паскаль в Торр, нажмите 3      |\n";
    cout<<"|Чтобы перевести Торр в Паскаль, нажмите 4      |\n";
    cout<<"|Чтобы перевести Паскаль в мм.рт.ст., нажмите 5 |\n";
    cout<<"|Чтобы перевести Паскаль в Бар, нажмите 6       |\n";
    cout<<"|Чтобы перевести Бар в атмосферу,нажмите 7      |\n";
    cout<<"|_______________________________________________|\n";
    float pressure;
    cin>>pressure;
    float res;
    if(pressure==0){
      res = a*1.013;
      cout<<"|"<<a<<" Атмосфер\t"<<"="<<" "<<res<<" "<<"Бар|\n";
    }
    if(pressure==1){
      res = a*100000;
      cout<<"|"<<a<<" Бар\t"<<"="<<" "<<res<<" "<<"Паскаль|\n";
    }
    if(pressure==2){
      res = a*133.32239023154;
      cout<<"|"<<a<<" мм.рт.ст.\t"<<"="<<" "<<res<<" "<<"Паскаль|\n";
    }
    if(pressure==3){
      res = a/133;
      cout<<"|"<<a<<" Паскаль\t"<<"="<<" "<<res<<" "<<"Торр|\n";
    }
    if(pressure == 4){
      res = a*133;
      cout<<"|"<<a<<"Торр\t"<<"="<<" "<<res<<" "<<"Торр|\n";
    }
    if(pressure == 5){
      res = a/133.32239023154;
      cout<<"|"<<a<<" Паскаль\t"<<"="<<" "<<res<<" "<<"мм.рт.ст.|\n";
    }
    if(pressure==6){
      res = a/100000;
      cout<<"|"<<a<<" Паскаль\t"<<"="<<" "<<res<<" "<<"Бар|\n";
    }
    if(pressure==7){
      res=a/1.013;
      cout<<"|"<<a<<" Бар\t"<<"="<<" "<<res<<" "<<"Атмосфер|\n";
    }
  }
  if(b==6){
    float num1;
    cout<<" ___________________________________________\n";
    cout<<"|Введите число, которое нужно конвертировать|\n";
    cout<<"|___________________________________________\n";
    cin>>num1;
    cout<<" ________________________________________________\n";
    cout<<"| чтобы перевести километры в дюймы, нажмите 13  |\n";
    cout<<"| чтобы перевести метры в дюймы, нажмите 14      |\n";
    cout<<"| чтобы перевести дециметры в дюймы, нажмите 15  |\n";
    cout<<"| чтобы перевести сантиметры в дюймы, нажмите 16 |\n";
    cout<<"| чтобы перевести миллиметры в дюймы, нажмите 17 |\n";
    cout<<"| чтобы перевести километры в мили, нажмите 18   |\n";
    cout<<"| чтобы перевести метры в мили, нажмите 19       |\n";
    cout<<"| Чтобы перевести дециметры в мили, нажмите 20   |\n";
    cout<<"| Чтобы перевести сантиметры в мили, нажмите 21  |\n";
    cout<<"| Чтобы перевести миллиметры в мили, нажмите 22  |\n";
    cout<<"|________________________________________________|\n";
    float length;
    cin>>length;
    float res;
    if(length==13){
      res = num1*39370;
      cout<<"|"<<num1<<" километров\t"<<"="<<" "<<res<<" "<<"дюймов|\n";
    }
    if(length==14){
      res = num1*39.3701;
      cout<<"|"<<num1<<" метров\t"<<"="<<" "<<res<<" "<<"дюймов|\n";
    }
    if(length==15){
      res = num1*3.93701;
      cout<<"|"<<num1<<" дециметров\t"<<"="<<" "<<res<<" "<<"дюймов|\n";
    }
    if(length==16){
      res = num1*2.54;
      cout<<"|"<<num1<<" сантиметров\t"<<"="<<" "<<res<<" "<<"дюймов|\n";
    }
    if(length==17){
      res = num1*25.4;
      cout<<"|"<<num1<<" миллиметров\t"<<"="<<" "<<res<<" "<<"дюймов|\n";
    }
    if(length==18){
      res = num1/1.609;
      cout<<"|"<<num1<<" километров\t"<<"="<<" "<<res<<" миль|\n";
    }
    if(length == 19){
      res = num1/1609;
      cout<<"|"<<num1<<" метров\t"<<"="<<" "<<res<<" миль|\n";
    }
    if(length==20){
      res = num1/16093;
      cout<<"|"<<num1<<" дециметров\t"<<"="<<" "<<res<<" миль|\n";
    }
    if(length==21){
      res = num1/160934;
      cout<<"|"<<num1<<" сантиметров\t"<<"="<<" "<<res<<" миль|\n";
    }
    if(length==22){
      res = num1/1.609e+6;
      cout<<"|"<<num1<<" миллиметров\t"<<"="<<" "<<res<<" миль|\n";
    }

  }
  if(b==7){
    float a;
    cout<<" ___________________________________________|\n";
    cout<<"|Введите число, которое нужно конвертировать|\n ";
    cout<<"|___________________________________________|\n";
    cin>>a;
    cout<<"________________________________________________\n";
   cout<<"| Чтобы перевести тонны в фунты, нажмите 10       |\n";
   cout<<"| Чтобы перевести килограммы в фунты,нажмите 11   |\n";
   cout<<"| Чтобы перевести граммы в фунты, нажмите 12      |\n";
   cout<<"| Чтобы перевести милиграммы в фунты, нажмите 13  |\n";
   cout<<"| чтобы перевести фунты в миллиграммы, нажмите 14 |\n";
   cout<<"| Чтобы перевести фунты в граммы, нажмите 15      |\n";
   cout<<"| Чтобы перевести фунты в килограммы, нажмите 16  |\n";
   cout<<"| Чтобы перевести фунты в тонны, нажмите 17       |\n";
   cout<<"|_________________________________________________|\n";
   float weight;
   cin>>weight;
   float res;
   if(weight == 10){
       res = a*2205;
       cout<<"|"<<a<<" тонн\t"<<"= "<<res<<" фунтов|\n";
     }
     if(weight==11){
       res = a*2.205;
       cout<<"|"<<a<<" килограмм\t"<<"= "<<res<<" фунтов|\n";
     }
     if(weight==12){
       res = a/454;
       cout<<"|"<<a<<" грамм\t"<<"= "<<res<<" фунтов|\n";
     }
     if(weight==13){
       res = a/453593;
       cout<<"|"<<a<<" миллиграмм\t"<<"= "<<res<<" фунтов|\n";
     }
     if(weight==14){
       res = a*453593;
       cout<<"|"<<a<<" фунтов\t"<<"= "<<res<<" миллиграмм|\n";
     }
     if(weight==15){
       res = a*454;
       cout<<"|"<<a<<" фунтов\t"<<"= "<<res<<" грамм|\n";
     }
     if(weight==16){
       res = a/2.205;
       cout<<"|"<<a<<" фунтов\t"<<"= "<<res<<" килограмм|\n";
     }
     if(weight==17){
       res = a/2205;
       cout<<"|"<<a<<" фунтов\t"<<"= "<<res<<" тонн|\n";
     }
}
     if(b==8){
       float a;
       cout<<" ___________________________________________\n";
       cout<<"|Введите число, которое нужно конвертировать|\n";
       cout<<"|___________________________________________|\n";
       cin>>a;
       cout<<" ___________________________________________________\n";
       cout<<"| Чтобы перевести ампер в килоампер, нажмите 0      |\n";
       cout<<"| Чтобы перевести килоампер в миллиампер, нажмите 1 |\n";
       cout<<"| Чтобы перевести миллиампер в био, нажмите 2       |\n";
       cout<<"| Чтобы перевести био в абампер, нажмите 3          |\n";
       cout<<"| Чтобы перевести ампер в миллиампер, нажмите 4     |\n";
       cout<<"| Чтобы перевести ампер в био, нажмите 5            |\n";
       cout<<"| Чтобы перевести килоампер в ампер, нажмите 6      |\n";
       cout<<"| Чтобы перевести килоампер в био, нажмите 7        |\n";
       cout<<"| Чтобы перевести миллиампер в ампер, нажмите 8     |\n";
       cout<<"| Чтобы перевести миллиампер в килоампер, нажмите 9 |\n";
       cout<<"|__________________________________________________|\n";
       float current;
       cin>>current;
       float res;
       if(current==0){
        res = a/1000;
        cout<<"|"<<a<<" ампер\t"<<"= "<<res<<" килоампер|\n";
       }
       if(current==1){
         res = a*1000000;
         cout<<"|"<<a<<" килоампер\t"<<"= "<<res<<" миллиампер|\n";
       }
       if(current==2){
         res = a/10000;
         cout<<"|"<<a<<" миллиампер\t"<<"= "<<res<<" био|\n";
       }
       if(current==3){
         res = a*1;
         cout<<"|"<<a<<" био\t"<<"= "<<res<<" абаметров\n";
       }
       if(current==4){
         res = a*1000;
         cout<<"|"<<a<<" ампер\t"<<"= "<<res<<" миллиампер|\n";
       }
       if(current==5){
         res = a/10;
         cout<<"|"<<a<<" ампер\t"<<"= "<<res<<" био|\n";
       }
       if(current==6){
         res = a*1000;
         cout<<"|"<<a<<" килоампер\t"<<"= "<<res<<" ампер|\n";
       }
       if(current==7){
         res = a*100;
         cout<<"|"<<a<<" килоампер\t"<<"= "<<res<<" био|\n";
       }
       if(current==8){
         res = a/1000;
         cout<<"|"<<a<<" миллиампер\t"<<"= "<<res<<" ампер|\n";
       }
       if(current==9){
         res=a/1000000;
         cout<<"|"<<a<<" миллиампер\t"<<"= "<<res<<" килоампер|\n";
       }
     }
  if(b==5){
    cout<<"Информация об обновлении vBeta 0.0.0.8:\n";
    cout<<"_____________________________________________\n";
    cout<<"|1)Абсолютно новый дизайн\n";
    cout<<"|2)Добавление блоков\n";
    cout<<"                  OPEN BETA                  \n";
    cout<<"_____________________________________________\n";
  }
  cout<<endl;
  cout<<endl;
  cout<<endl;
  cout<<endl;
  cout<<endl;
  cout<<endl;
  cout<<endl;
  cout<<"Oleg inc 22.05.20(15:34)-23.05.20(14:17). Все права защищены.  Для жалоб или пожеланий - anderzanovoleg@gmail.com\n";
  cout<<endl;
  cout<<endl;
  cout<<"\t"<<"\t"<<"Все данные были взяты с сайта Google.com\n";
return 0;
}
