#include <iostream>
#include <string>
using namespace std;
int main(){
  int button;
  cout<<"разработанно Андержановым Олегом\n";
  cout<<"Здравствуйте, вас приветсвует Олегоконвертер vBeta 0.0.0.5! Чтобы продолжить, нажмите любую цифру\n";
  cin>>button;
  cout<<"Выбери единицу измерения\n";
  cout<<"чтобы выбрать температру, нажмите 1\n";
  cout<<"чтобы выбрать длинну, нажмите 2\n";
  cout<<"чтобы выбрать массу, нажмите 3\n";
  cout<<"чтобы выбрать давление, нажмите 4(малый арсенал)\n";
  cout<<"информация об обновлении - 5\n";

  int b;
  cin>>b;
  if(b == 1){
  float a;
  cout<<"введите число ";
  cin>>a;
cout<<"Чтобы перевести температуру из Фаренгейта в Цельсий, нажмите 0\n";
cout<<"Чтобы перевести температуру из цельсия в фаренгейт, нажмите 1\n";
cout<<"Чтобы перевести температуру из кельвина в Цельсий, нажмите 2\n";
cout<<"Чтобы перевести температуру из цельсия в кельвин, нажмите 3\n";
cout<<"Чтобы перевести температуру из кельвина в фаренгейт, нажмите 4\n";
cout<<"чтобы перевести температуру из фаренгета в кельвин, нажмите 5\n";
float temperature;
cin>>temperature;
float res;
if(temperature==0){
  res = (a-32)*5/9;
  cout<<"темепратура по Цельсию равна"<<" "<<res<<" "<<"градусов\n";
} else {
  if(temperature==1){
  res = a*9/5+32;
  cout<<"Температура по Фаренгейту равна"<<" "<<res<<" "<<"градусов\n";
  }
}
if(temperature == 2){
  res = a-273.15;
  cout<<"Температура по Кельвину равна"<<" "<<res<<" "<<"градусов\n";
}
if(temperature == 3){
  res = a+273.15;
  cout<<"Температура по Цельсию равна"<<" "<<res<<" ";
}
if(temperature == 4){
  res = (a-273.15)*9/5+32;
  cout<<"Температура по фаренгейту равна"<<" "<<res<<" "<<"градусов\n";
}
if(temperature == 5){
  res = (a-32)*5/9+273.15;
  cout<<"Температура по кельвину равна"<<" "<<res<<" "<<"градусов\n";
}
  }
  if(b==2){
    float num1;
    cout<<"введите число"<<" ";
    cin>>num1;
    cout<<"чтобы перевести километры в метры, нажмите 0\n";
    cout<<"чтобы перевести метр в дециметр, нажмите 1\n";
    cout<<"чтобы перевести дециметр в сантиметр, нажмите 2\n";
    cout<<"чтобы перевести сантиметр в миллиметр, нажмите 3\n";
    cout<<"чтобы перевести метры в километры, нажмите 4\n";
    cout<<"чтобы перевести дециметры в метры, нажмите 5\n";
    cout<<"чтобы перевести сантиметры в дециметры, нажмите 6\n";
    cout<<"чтобы перевести миллиметры в сантиметры, нажмите 7\n";
    cout<<"чтобы перевести километры в дециметры, нажмите 8\n";
    cout<<"чтобы перевести километры в сантиметры, нажмите 9\n";
    cout<<"чтобы перевести километры в миллиметры, нажмите 10\n";
    cout<<"чтобы перевести метры в сантиметры, нажмите 11(new!)\n";
    cout<<"чтобы перевести метры в миллиметры, нажмите 12(new!)\n";
    cout<<"чтобы перевести километры в дюймы, нажмите 13(new!)\n";
    cout<<"чтобы перевести метры в дюймы, нажмите 14(in development)\n";
    cout<<"чтобы перевести дециметры в дюймы, нажмите 15(in development)\n";
    cout<<"чтобы перевести сантиметры в дюймы, нажмите 16(in development)\n";
    cout<<"чтобы перевести миллиметры в дюймы, нажмите 17(in development)\n";
    float length;
    cin>>length;
    float res;
    if(length==0){
      res = num1*1000;
      cout<<num1<<" "<<"километров\t"<<"="<<" "<<res<<" "<<"метров"<<endl;
    }
    if(length==1){
      res = num1*10;
      cout<<num1<<" "<<"метров\t"<<"="<<" "<<res<<" "<<"дециметров\n";
    }
    if(length == 2){
      res = num1*10;
      cout<<num1<<" "<<"дециметров\t"<<"="<<" "<<res<<" "<<"сантиметров\n";
    }
    if(length==3){
      res = num1*10;
      cout<<num1<<" "<<"сантиметров\t"<<"="<<" "<<res<<" "<<"миллиметров\n";
    }
    if(length == 4){
      res = num1/1000;
      cout<<num1<<" "<<"метров\t"<<"="<<" "<<res<<" "<<"километров\n";
    }
    if(length == 5){
      res = num1/10;
      cout<<num1<<" "<<"дециметров\t"<<"="<<" "<<res<<" "<<"метров\n";
    }
    if(length==6){
      res = num1/10;
      cout<<num1<<" "<<"сантиметров\t"<<"="<<" "<<res<<" "<<"дециметров\n";
    }
    if(length==7){
      res = num1/10;
      cout<<num1<<" "<<"миллиметров\t"<<"="<<" "<<res<<" "<<"сантиетров\n";
    }
    if(length==8){
      res = num1*10000;
      cout<<num1<<" "<<"километров\t"<<"="<<" "<<res<<" "<<"Дециметров\n";
    }
    if(length==9){
      res = num1*100000;
      cout<<num1<<" "<<"километров\t"<<"="<<" "<<res<<" "<<"сантиметров"<<endl;
    }
    if(length==10){
      res = num1*1000000;
      cout<<num1<<" "<<"километров\t"<<"="<<" "<<res<<" "<<"миллиметров\n";
    }
    if(length==11){
      res = num1*100;
      cout<<num1<<" "<<"метров\t"<<"="<<" "<<res<<" "<<"сантиметров\n";
    }
    if(length==12){
      res = num1*1000;
      cout<<num1<<" "<<"метров\t"<<"="<<" "<<res<<" "<<"миллиметров"<<endl;
    }
    if(length==13){
      res = num1*39370;
      cout<<num1<<" "<<"километров\t"<<"="<<" "<<res<<" "<<"дюймов\n";
    }
    if(length==14){
      res = num1;
    }
  }
  if(b==3){
   float a;
   cout<<"Введите число"<<" ";
   cin>>a;
   cout<<"Чтобы перевести тонну в килограммы, нажмите 0\n";
   cout<<"Чтобы перевести килограммы в граммы, нажмите 1\n;";
   cout<<"Чтобы перевести граммы в миллиграммы, нажмите 2\n";
   cout<<"Чтобы перевести миллиграммы в граммы, нажмите 3\n";
   cout<<"Чтобы перевести граммы в килограммы, нажмите 4\n";
   cout<<"Чтобы перевести килограммы в тонны, нажмите 5\n";
   cout<<"Чтобы перевести тонны в граммы, нажмите 6\n";
   cout<<"Чтобы перевести тонны в миллиграммы, нажмите 7\n";
   cout<<"Чтобы перевести килограммы в миллиграммы, нажмите 8(new!)\n";
   cout<<"Чтобы перевести граммы в тонны. нажмите 9(new!)\n";
   float weight;
   cin>>weight;
   float res;
   if(weight==0){
     res = a*1000;
     cout<<a<<" "<<"тонн\t"<<"="<<" "<<res<<" "<<"килограмм\n";
   }
   if(weight==1){
     res = a*1000;
     cout<<a<<" "<<"килограмм\t"<<"="<<" "<<res<<" "<<"грамм\n";
   }
   if(weight==2){
     res = a*1000;
     cout<<a<<" "<<"грамм\t"<<"="<<" "<<res<<" "<<"миллиграмм\n";
  }
  if(weight==3){
    res = a/1000;
    cout<<a<<" "<<"миллиграмм\t"<<"="<<" "<<res<<" "<<"грамм\n";
  }
     if(weight == 4){
       res = a/1000;
       cout<<a<<" "<<"грамм\t"<<"="<<" "<<res<<" "<<"килограмм"<<endl;
     }
     if(weight == 5){
       res = a/1000;
       cout<<a<<" "<<"килограмм\t"<<"="<<" "<<res<<"тонн\n";
     }
     if(weight==6){
       res = a*1000000;
       cout<<a<<" "<<"тонн\t"<<"="<<" "<<res<<" "<<"грамм\n";
     }
     if(weight==7){
       res = a*1000000000;
       cout<<a<<" "<<"тонн\t"<<"="<<" "<<res<<" "<<"грамм\n";
     }
     if(weight==8){
       res = a*1000000;
       cout<<a<<"килограмм\t"<<"="<<" "<<res<<" "<<"миллиграмм\n";
     }
     if(weight==9){
       res = a/1000000;
       cout<<a<<"грамм\t"<<"="<<" "<<res<<" "<<"тонн\n";
     }
  }
  if(b==4){
    float a;
    cout<<"Введите число"<<" ";
    cin>>a;
    cout<<"Чтобы перевести Атмосферу в Бар, нажмите 0\n";
    cout<<"Чтобы перевести Бар в Паскаль, нажмите 1\n";
    cout<<"Чтобы перевести мм.рт.ст. в Паскаль, нажмите 2\n";
    cout<<"Чтобы перевести Паскаль в Торр, нажмите 3\n";
    cout<<"Чтобы перевести Торр в Паскаль, нажмите 4\n";
    cout<<"Чтобы перевести Паскаль в мм.рт.ст., нажмите 5\n";
    cout<<"Чтобы перевести Паскаль в Бар, нажмите 6\n";
    cout<<"Чтобы перевести Бар в атмосферу,нажмите 7\n";
    float pressure;
    cin>>pressure;
    float res;
    if(pressure==0){
      res = a*1.013;
      cout<<a<<" "<<"Атмосфер\t"<<"="<<" "<<res<<" "<<"Бар\n";
    }
    if(pressure==1){
      res = a*100000;
      cout<<a<<" "<<"Бар\t"<<"="<<" "<<res<<" "<<"Паскаль\n";
    }
    if(pressure==2){
      res = a*133.32239023154;
      cout<<a<<" "<<"мм.рт.ст.\t"<<"="<<" "<<res<<" "<<"Паскаль\n";
    }
    if(pressure==3){
      res = a/133;
      cout<<a<<" "<<"Паскаль\t"<<"="<<" "<<res<<" "<<"Торр\n";
    }
    if(pressure == 4){
      res = a*133;
      cout<<a<<" "<<"Торр\t"<<"="<<" "<<res<<" "<<"Торр\n";
    }
    if(pressure == 5){
      res = a/133.32239023154;
      cout<<a<<" "<<"Паскаль\t"<<"="<<" "<<res<<" "<<"мм.рт.ст.\n";
    }
    if(pressure==6){
      res = a/100000;
      cout<<a<<" "<<"Паскаль\t"<<"="<<" "<<res<<" "<<"Бар\n";
    }
    if(pressure==7){
      res=a/1.013;
      cout<<a<<" "<<"Бар\t"<<"="<<" "<<res<<" "<<"Атмосфер\n";
    }
  }
  if(b==5){
    cout<<"Инвормация об обновлении vBeta 0.0.0.5:\n";
    cout<<"_____________________________________________\n";
    cout<<"1) Добавленна новая библиотека для создания именных переменных\n";
    cout<<"2) добавлен перевод из метров в сантиметры\n";
    cout<<"3) Добавлен перевод из метров в миллиметры\n";
    cout<<"4)Добавлен перевод из килограммов в миллиграммы\n";
    cout<<"5)Добавлен перевод из граммов в тонны\n";
  }
  cout<<endl;
  cout<<endl;
  cout<<endl;
  cout<<endl;
  cout<<endl;
  cout<<endl;
  cout<<endl;
  cout<<"Oleg inc 2020-2020. Все права защищены.  Для жалоб или пожеланий - anderzanovoleg@gmail.com\n";
return 0;
}
